In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("train.csv")

In [3]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [4]:
df.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  42
New_Price            5195
Price                   0
dtype: int64

In [5]:
df.shape

(6019, 13)

In [6]:
#drop the new_price column
df.drop("New_Price",axis=1,inplace=True)

In [7]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74

In [8]:

df[df["Mileage"].isna()]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
4446,Mahindra E Verito D4,Chennai,2016,50000,Electric,Automatic,First,NaN,72 CC,41 bhp,5.0,13.00
4904,Toyota Prius 2009-2016 Z4,Mumbai,2011,44000,Electric,Automatic,First,NaN,1798 CC,73 bhp,5.0,12.75

In [10]:
df[df["Engine"].isna()].head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
194,Honda City 1.5 GXI,Ahmedabad,2007,60006,Petrol,Manual,First,0.0 kmpl,NaN,NaN,NaN,2.95
208,Maruti Swift 1.3 VXi,Kolkata,2010,42001,Petrol,Manual,First,16.1 kmpl,NaN,NaN,NaN,2.11
733,Maruti Swift 1.3 VXi,Chennai,2006,97800,Petrol,Manual,Third,16.1 kmpl,NaN,NaN,NaN,1.75
749,Land Rover Range Rover 3.0 D,Mumbai,2008,55001,Diesel,Automatic,Second,0.0 kmpl,NaN,NaN,NaN,26.50
1294,Honda City 1.3 DX,Delhi,2009,55005,Petrol,Manual,First,12.8 kmpl,NaN,NaN,NaN,3.20

## Split the car name of the column (Name) and put the return in a New_name

In [11]:
df["New_name"] = df["Name"].apply(lambda x:x.split(" ")[0])

In [13]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,New_name
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi

Explaination

In [14]:
"Tamer Elkot".split(' ')[1]

'Elkot'

In [15]:
def split_name(name):
  return  name.split(" ")[0]

In [16]:
df["Name"].apply(split_name)

0          Maruti
1         Hyundai
2           Honda
3          Maruti
4            Audi
          ...
6014       Maruti
6015      Hyundai
6016     Mahindra
6017       Maruti
6018    Chevrolet
Name: Name, Length: 6019, dtype: object

## Drop the value counts that is smaller than 13 in the (New Name) column

In [17]:
df["New_name"].value_counts()

New_name
Maruti           1211
Hyundai          1107
Honda             608
Toyota            411
Mercedes-Benz     318
Volkswagen        315
Ford              300
Mahindra          272
BMW               267
Audi              236
Tata              186
Skoda             173
Renault           145
Chevrolet         121
Nissan             91
Land               60
Jaguar             40
Fiat               28
Mitsubishi         27
Mini               26
Volvo              21
Porsche            18
Jeep               15
Datsun             13
Force               3
ISUZU               2
Smart               1
Isuzu               1
Ambassador          1
Bentley             1
Lamborghini         1
Name: count, dtype: int64

In [20]:
counts=df["New_name"].value_counts()

In [21]:
counts[counts<13]

New_name
Force          3
ISUZU          2
Smart          1
Isuzu          1
Ambassador     1
Bentley        1
Lamborghini    1
Name: count, dtype: int64

In [22]:
counts[counts<13].index

Index(['Force', 'ISUZU', 'Smart', 'Isuzu', 'Ambassador', 'Bentley',
       'Lamborghini'],
      dtype='object', name='New_name')

another way in one line to filter the value counts that is under 13

In [23]:
values_to_drop=df["New_name"].value_counts()[df["New_name"].value_counts()<13].index

In [24]:
values_to_drop

Index(['Force', 'ISUZU', 'Smart', 'Isuzu', 'Ambassador', 'Bentley',
       'Lamborghini'],
      dtype='object', name='New_name')

In [25]:
df[df["New_name"].isin(values_to_drop)]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,New_name
915,Smart Fortwo CDI AT,Pune,2008,103000,Diesel,Automatic,Second,0.0 kmpl,799 CC,null bhp,2.0,3.00,Smart
1221,Ambassador Classic Nova Diesel,Chennai,2003,80000,Diesel,Manual,Third,12.8 kmpl,1489 CC,35.5 bhp,5.0,1.35,Ambassador
2900,Isuzu MUX 4WD,Jaipur,2017,34429,Diesel,Automatic,First,13.8 kmpl,2999 CC,174.57 bhp,7.0,20.00,Isuzu
3624,ISUZU D-MAX V-Cross 4X4,Coimbatore,2018,20422,Diesel,Manual,First,12.4 kmpl,2499 CC,134 bhp,5.0,16.09,ISUZU
4997,Force One LX 4x4,Chennai,2014,50000,Diesel,Manual,First,17.0 kmpl,2200 CC,139.01 bhp,7.0,12.00,Force
5182,Force One LX ABS 7 Seating,Kolkata,2014,41000,Diesel,Manual,First,17.0 kmpl,2149 CC,139.07 bhp,7.0,8.00,Force
5206,Force One LX 4x4,Kolkata,2014,41000,Diesel,Manual,First,17.0 kmpl,2200 CC,139.01 bhp,7.0,8.00,Force
5521,Bentley Continental Flying Spur,Hyderabad,2006,48000,Petrol,Automatic,First,8.6 kmpl,5998 CC,552 bhp,4.0,59.00,Bentley
5781,Lamborghini Gallardo Coupe,Delhi,2011,6500,Petrol,Automatic,Third,6.4 kmpl,5204 CC,560 bhp,2.0,120.00,Lamborghini
5979,ISUZU D-MAX V-Cross 4X4,Jaipur,2017,25000,Diesel,Manual,First,12.4 kmpl,2499 CC,134 bhp,5.0,8.00,ISUZU

to get the index of the value counts to drop

In [26]:
indecies_to_drop=df[df["New_name"].isin(values_to_drop)].index

In [27]:
indecies_to_drop

Index([915, 1221, 2900, 3624, 4997, 5182, 5206, 5521, 5781, 5979], dtype='int64')

In [28]:
df.drop(indecies_to_drop,inplace=True)

In [ ]:
df["New_name"].value_counts()

New_name
Maruti           1211
Hyundai          1107
Honda             608
Toyota            411
Mercedes-Benz     318
Volkswagen        315
Ford              300
Mahindra          272
BMW               267
Audi              236
Tata              186
Skoda             173
Renault           145
Chevrolet         121
Nissan             91
Land               60
Jaguar             40
Fiat               28
Mitsubishi         27
Mini               26
Volvo              21
Porsche            18
Jeep               15
Datsun             13
Name: count, dtype: int64

:

In [152]:
fuel_counts=df["Fuel_Type"].value_counts()

In [153]:
fuel_counts

Fuel_Type
Diesel      3197
Petrol      2744
CNG           56
LPG           10
Electric       2
Name: count, dtype: int64

## Drop the the rows that contain  CNG , LPG ,Electirc in the (Fuel_Type) column

In [154]:
fuel_counts<=56

Fuel_Type
Diesel      False
Petrol      False
CNG          True
LPG          True
Electric     True
Name: count, dtype: bool

In [155]:
fuel_counts[fuel_counts<=56].index

Index(['CNG', 'LPG', 'Electric'], dtype='object', name='Fuel_Type')

In [156]:
df[df["Fuel_Type"].isin(fuel_counts[fuel_counts<=56].index)]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,New_name
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti
5,Hyundai EON LPG Era Plus Option,Hyderabad,2012,75000,LPG,Manual,First,21.1 km/kg,814 CC,55.2 bhp,5.0,2.35,Hyundai
127,Maruti Wagon R LXI CNG,Pune,2013,89900,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,3.25,Maruti
328,Maruti Zen Estilo LXI Green (CNG),Pune,2008,42496,CNG,Manual,First,26.3 km/kg,998 CC,67.1 bhp,5.0,1.40,Maruti
440,Maruti Eeco 5 STR With AC Plus HTR CNG,Kochi,2017,31841,CNG,Manual,First,15.1 km/kg,1196 CC,73 bhp,5.0,4.70,Maruti
...,...,...,...,...,...,...,...,...,...,...,...,...,...
5876,Maruti Ertiga VXI CNG,Mumbai,2017,23700,CNG,Manual,First,17.5 km/kg,1373 CC,80.46 bhp,7.0,8.25,Maruti
5881,Maruti Wagon R LXI CNG,Pune,2015,55000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,3.70,Maruti
5902,Maruti Wagon R LXI CNG,Mumbai,2012,72000,CNG,Manual,First,26.2 km/kg,998 CC,58.2 bhp,5.0,2.25,Maruti
5935,Maruti Alto K10 LXI CNG,Pune,2015,59525,CNG,Manual,Second,32.26 km/kg,998 CC,58.2 bhp,4.0,3.10,Maruti
5997,Maruti Wagon R Duo Lxi,Jaipur,2010,70000,LPG,Manual,First,26.2 km/kg,998 CC,58.2 bhp,5.0,2.27,Maruti

In [157]:
df[df["Fuel_Type"].isin(fuel_counts[fuel_counts<=56].index)].index

Index([   0,    5,  127,  328,  440,  839,  893,  936,  987, 1135, 1218, 1269,
       1323, 1332, 1357, 1573, 1780, 1911, 1914, 2059, 2110, 2228, 2278, 2323,
       2371, 2376, 2385, 2436, 2437, 2516, 2527, 2638, 2701, 2941, 3008, 3031,
       3097, 3119, 3129, 3180, 3295, 3455, 3511, 3553, 3586, 3595, 3722, 3869,
       3901, 4098, 4141, 4411, 4446, 4603, 4769, 4904, 4920, 5004, 5178, 5506,
       5655, 5710, 5747, 5876, 5881, 5902, 5935, 5997],
      dtype='int64')

In [158]:
df.drop(df[df["Fuel_Type"].isin(fuel_counts[fuel_counts<=56].index)].index,inplace=True)

In [159]:
df["Fuel_Type"].value_counts()

Fuel_Type
Diesel    3197
Petrol    2744
Name: count, dtype: int64

In [160]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,New_name
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi
6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,3.50,Nissan

## Split on the Mileage,Engine,power to take only the numeric values from them

In [161]:
df["Mileage_New"]=df["Mileage"].str.split(" ").str[0]

In [162]:
df.dtypes

Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage               object
Engine                object
Power                 object
Seats                float64
Price                float64
New_name              object
Mileage_New           object
dtype: object

In [163]:
df.isna().sum()

Name                  0
Location              0
Year                  0
Kilometers_Driven     0
Fuel_Type             0
Transmission          0
Owner_Type            0
Mileage               0
Engine               36
Power                36
Seats                42
Price                 0
New_name              0
Mileage_New           0
dtype: int64

In [164]:
df.dropna(axis=0,inplace=True)

In [165]:
# it will raise this error >> AttributeError: 'float' object has no attribute 'split'
df["Power_New"]=df["Power"].apply(lambda x : x.split(" ")[0])

Note that the NaN values its type is float
so the error raised because i use split function on float but it only use for string (object data type)

In [166]:
df["Engine_New"]=df["Engine"].apply(lambda x:x.split(" ")[0])

In [167]:
df.isna().sum()

Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
Price                0
New_name             0
Mileage_New          0
Power_New            0
Engine_New           0
dtype: int64

In [168]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,New_name,Mileage_New,Power_New,Engine_New
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,19.67,126.2,1582
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,18.2,88.7,1199
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,20.77,88.76,1248
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,15.2,140.8,1968
6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,3.50,Nissan,23.08,63.1,1461

In [169]:
df["Owner_Type"].value_counts()

Owner_Type
First             4843
Second             940
Third              108
Fourth & Above       8
Name: count, dtype: int64

# drop Fourth & Above row from Owner_Type column

In [173]:
df[df["Owner_Type"].isin(["Fourth & Above"])].index

Index([29, 885, 1081, 1699, 2988, 3368, 4148, 5647], dtype='int64')

In [174]:
df.drop(df[df["Owner_Type"].isin(["Fourth & Above"])].index,inplace=True)

In [175]:
df.head(2)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,New_name,Mileage_New,Power_New,Engine_New
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.5,Hyundai,19.67,126.2,1582
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.5,Honda,18.2,88.7,1199

In [176]:
df["Transmission"].value_counts()

Transmission
Manual       4187
Automatic    1704
Name: count, dtype: int64

In [177]:
df["Year"].value_counts()

Year
2014    780
2016    736
2015    732
2013    639
2017    579
2012    561
2011    458
2010    333
2018    293
2009    195
2008    164
2007    120
2019    101
2006     74
2005     53
2004     29
2002     14
2003     14
2001      6
2000      4
1998      4
1999      2
Name: count, dtype: int64

## Drop the rows that its year <= 2001

In [182]:
df.drop(df[df["Year"]<=2001].index,inplace=True)

In [185]:
df["Year"].value_counts()

Year
2014    780
2016    736
2015    732
2013    639
2017    579
2012    561
2011    458
2010    333
2018    293
2009    195
2008    164
2007    120
2019    101
2006     74
2005     53
2004     29
2002     14
2003     14
Name: count, dtype: int64

In [183]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,New_name,Mileage_New,Power_New,Engine_New
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,19.67,126.2,1582
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,18.2,88.7,1199
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,20.77,88.76,1248
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,15.2,140.8,1968
6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,3.50,Nissan,23.08,63.1,1461

In [186]:
df["Location"].value_counts()

Location
Mumbai        763
Hyderabad     729
Kochi         640
Coimbatore    632
Pune          591
Delhi         538
Kolkata       527
Chennai       482
Jaipur        401
Bangalore     352
Ahmedabad     220
Name: count, dtype: int64

# Remove unnessary columns

In [188]:
df.columns

Index(['Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type',
       'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats',
       'Price', 'New_name', 'Mileage_New', 'Power_New', 'Engine_New'],
      dtype='object')

In [189]:
df.drop(['Engine', 'Power','Name','Mileage'],axis=1,inplace=True)

In [187]:
df.dtypes

Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage               object
Engine                object
Power                 object
Seats                float64
Price                float64
New_name              object
Mileage_New           object
Power_New             object
Engine_New            object
dtype: object

In [190]:
df.head(2)

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Seats,Price,New_name,Mileage_New,Power_New,Engine_New
1,Pune,2015,41000,Diesel,Manual,First,5.0,12.5,Hyundai,19.67,126.2,1582
2,Chennai,2011,46000,Petrol,Manual,First,5.0,4.5,Honda,18.2,88.7,1199

In [192]:
df.dtypes

Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Seats                float64
Price                float64
New_name              object
Mileage_New           object
Power_New             object
Engine_New            object
dtype: object

# convert the categorical data into numerical data that's already numeric

In [193]:
pd.to_numeric(df["Mileage_New"])

1       19.67
2       18.20
3       20.77
4       15.20
6       23.08
        ...
6014    28.40
6015    24.40
6016    14.00
6017    18.90
6018    25.44
Name: Mileage_New, Length: 5875, dtype: float64

In [194]:
pd.to_numeric(df["Engine_New"])

1       1582
2       1199
3       1248
4       1968
6       1461
        ...
6014    1248
6015    1120
6016    2498
6017     998
6018     936
Name: Engine_New, Length: 5875, dtype: int64

In [198]:
df.iloc[73]

Location             Jaipur
Year                   2008
Kilometers_Driven    111111
Fuel_Type            Diesel
Transmission         Manual
Owner_Type            First
Seats                   5.0
Price                   2.0
New_name               Ford
Mileage_New            17.8
Power_New              null
Engine_New             1399
Name: 76, dtype: object

In [200]:
# It rais this Erorr>> ValueError: Unable to parse string "null" at position 73
# this mean that is there a string value in the power_New column expected to be a number to convert it to numeric
# to solve this we will use >> errors="coerce"
df["Power_New"]=pd.to_numeric(df["Power_New"],errors="coerce")

In [201]:
df.isna().sum()

Location              0
Year                  0
Kilometers_Driven     0
Fuel_Type             0
Transmission          0
Owner_Type            0
Seats                 0
Price                 0
New_name              0
Mileage_New           0
Power_New            97
Engine_New            0
dtype: int64

In [202]:
df["Engine_New"]=pd.to_numeric(df["Engine_New"],errors="coerce")

In [203]:
df["MIleage_New"]=pd.to_numeric(df["Mileage_New"],errors="coerce")

In [205]:
df.isna().sum()

Location              0
Year                  0
Kilometers_Driven     0
Fuel_Type             0
Transmission          0
Owner_Type            0
Seats                 0
Price                 0
New_name              0
Mileage_New           0
Power_New            97
Engine_New            0
MIleage_New           0
dtype: int64

## Stop at minute 1:56:16 in the record

In [ ]:
df["Power_New"]